[
    {
      "id": "1",
      "title": "Forgotten Genocide: The Great Calcutta Killings of 1946",
      "description": "On August 16, 1946, the Muslim League’s Direct Action Day unleashed terror in Kolkata, with armed mobs killing thousands of Hindus..",
      "description2": "On August 16, 1946, the Muslim League’s Direct Action Day unleashed terror in Kolkata, with armed mobs killing thousands of Hindus, burning homes, and raping women under state-backed protection. The violence spilled into the Noakhali Genocide, displacing entire Hindu communities. These atrocities set the stage for India’s Partition, leaving scars of communal hatred that linger to this day.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/8/87/Calcutta_1946_riot.jpg",
      "sections": [
        {
          "subtitle": "comingsoon",
          "content": "comingsoon"
        }]
    },
    {
      "id": "2",
      "title": "Navigating Ancient India: Unveiling the Maritime Legacy",
      "description": "Ancient India’s shipbuilding prowess was unmatched, with advanced techniques documented in texts like Yukti Kalpa Taru...",
      "description2":"Ancient India’s shipbuilding prowess was unmatched, with advanced techniques documented in texts like Yukti Kalpa Taru. Indian mariners developed specialized ships for trade, warfare, and royal transport, alongside the invention of the Maccha Yantra—an early compass. With colonies from Cambodia to Japan, India’s maritime legacy shaped world trade and exploration, revealing the untold secrets of this ancient maritime empire. ",
      "imageUrl": "https://maritimeindia.org/wp-content/uploads/2023/01/Indias-Maritime-Identity.png",
      "sections": [
        {
          "subtitle": "comingsoon",
          "content": "comingsoon"
        }]
      
    },
    {
      "id": "3",
      "title": "Bappa Rawal: Guardian of Mewar's Legacy",
      "description": "Bappa Rawal (713–753 CE) was the founder of the Sisodia dynasty in Mewar, Rajasthan.",
      "description2": "Bappa Rawal (713–753 CE) was the founder of the Sisodia dynasty in Mewar, Rajasthan. He is celebrated for repelling Arab invasions and establishing the Sisodia rule in Chittor, which became a stronghold of Rajput resistance. A devotee of Lord Shiva, Bappa Rawal revitalized Hindu traditions and played a crucial role in shaping Rajput identity. His legacy is marked by valor and devotion, making him a significant figure in Indian history.",
      "imageUrl": "https://organiser.org/wp-content/uploads/2023/08/bappa-rawal.jpeg",
      "sections": [
        {
          "subtitle": "Full Name:",
          "content": "His birth name was Kalbhoj, but he is famously known as Bappa Rawal. His name is synonymous with the start of one of the most illustrious dynasties in Rajasthan, the Sisodia Rajputs of Mewar."
        },
        {
          "subtitle": "Dynastic Importance:",
          "content": "Bappa Rawal's ascension to the throne marks the beginning of Mewar’s golden era. The Sisodia dynasty, which he founded, went on to produce legendary figures like Maharana Pratap. His founding of the Sisodia line cemented Mewar as a powerful kingdom, both in terms of military strength and cultural heritage."
        },
        {
          "subtitle": "Early Life and Ascension",
          "content": "Birth and Lineage: Born in 713 CE, Bappa Rawal belonged to the Guhilot clan, a Rajput clan associated with royalty in Rajasthan. His father, Mahendra II, was a ruler of the Guhilot dynasty."
        },
        {
          "subtitle": "Ascension to Power:",
          "content": "Bappa Rawal’s rise to power came after defeating the Mori dynasty, which was ruling the Chittor region at the time."
        },
        {
          "subtitle": "Defeating Arab Invaders",
          "content": "During the 8th century, Arab forces under the Umayyad Caliphate were aggressively expanding into India, having already conquered Sindh under the leadership of Muhammad bin Qasim. They continued to push eastward, threatening the Indian heartland."
        },
        {
          "subtitle": "Victory over Arabs:",
          "content": "Bappa Rawal is celebrated for repelling these Arab invasions. While the precise historical details vary, it is generally agreed that he played a crucial role in halting the Arab advances, which aimed to expand beyond Sindh into Rajasthan and central India. His victory is often viewed as a significant event, as it prevented further Arab incursions into India, preserving the region’s autonomy and Hindu cultural heritage."
        },
        {
          "subtitle": "Capture of Chittor & Chittor Fort:",
          "content": "Bappa Rawal’s capture of Chittor is one of the defining moments of his reign. Chittor became the capital of Mewar and a symbol of Rajput valor and resistance for centuries. Chittor Fort was one of the largest and most impregnable forts in India."
        },
        {
          "subtitle": "Strategic Alliances and Military Campaigns:",
          "content": "Bappa Rawal forged strategic alliances with neighboring Rajput rulers and regional kingdoms. This was a critical move, as it ensured the stability of his kingdom and its defense against potential threats, both internal and external."
        },
        {
          "subtitle": "Expanding Mewar’s Reach:",
          "content": "Bappa Rawal’s military campaigns were aimed at consolidating his power and securing Mewar’s borders. By successfully integrating smaller kingdoms into his rule and establishing alliances, he created a buffer zone around Mewar, safeguarding it from invasions. His tactical brilliance helped Mewar thrive and flourish in a turbulent era."
        },
        {
          "subtitle": "Religious Legacy:",
          "content": "Bappa Rawal is known for his patronage of Hinduism, particularly the Shaivite tradition (devotees of Lord Shiva). He was instrumental in revitalizing traditional Vedic practices and temple patronage during a time when the subcontinent faced religious shifts due to external invasions."
        },
        {
          "subtitle": "Revival of Vedic Practices:",
          "content": "Bappa Rawal is said to have founded the famous Eklingji Temple near Udaipur, dedicated to Lord Shiva. The temple became a spiritual center for the Sisodia kings, who considered themselves the 'diwans' (servants) of Eklingji, while the deity was regarded as the real ruler of Mewar."
        }
      ]
    }
  ]